{"generatedAt":1747312373926,"generateTime":121,"contents":[{"_path":"/blog/a-deeper-thought-on-podcast","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"Is Podcast a productivity kill?","description":"How productive is listening to podcast","slug":"a-deeper-thought-on-podcast","publishedDate":"Sep 11, 2021","abstract":"Podcasts are becoming a major source of original content - entertainment or educational. But is it just a white noise or adding real value.","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I love listening to podcasts. It makes a perfect white noise. But I mostly listen to it while commuting to work. It tends to make my commute feel productive. ... but I am not so sure."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Definitely, there are podcasters who add value to our personal and professional development. We learn new ideas and find new perspective. But more importantly, we discover new artists, entrepreneurs, thinkers and scientists. We get a chance to review our belief system and improve it."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"But a few months ago, I noticed that podcasts weren't really adding any value. I was listening to the same set of people talking about the same things, debating about the same old topics. I wondered why I was even listening."}]},{"type":"element","tag":"blockquote","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"It seemed to reinforce my own eco-chamber. And that is dangerous in this day and age. The audio content, especially, in my opinion, has a strange ability to influence our thoughts. It can begin to sound like a voice of authority speaking to our soul. Why is that?"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The audio content is different from image, video or text. Not in terms of the format but in a way we consume them. Text, video and image requires some level of commitment - but not audio. You can play the audio in the background or even in a distance and you can still hear it and make some sense of it. And it is this subliminal nature which causes it to be more impactful, especially when it is always on and you are listening to it on repeat."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"When the same song is playing in the background for hours, once it stops, even after many hours or days, it lingers in our head and suddenly we find ourselves humming it. It happens unconsciously. This doesn’t happen with other forms of content. They don’t automatically appear in our mind like music. And there is more."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you try sleeping while listening to a podcast or an audio book, the audio starts to merge with our dreams and the people in our dream start to speak those words- like some movie script. It has happened so many times with me. It always leaves a very strange feeling even after you wake up."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Similarly, with podcasts (or audio content), we tend to sync our brain with its rhythm. It isn’t about what is being said or being discussed. It reorganises or soothes our brain - similar to music. One supporting fact to this claim is that when we listen to audio books or podcasts, we are never 100% tuned in. We aren’t really listening to it with a strong intention to understand. We are just letting it hit our subconscious. This is why, when you truly want to understand what is being discussed or said, you have to stop everything, rewind and listen a few times. Isn’t that the same with class lectures?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Unless we are super attentive we don’t understand everything being taught and we need to make notes and revisit the lectures to fully understand it. But we don’t usually revisit podcast content isn’t it? How can we?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Most podcasts are minimum 1 hour long and the interface mostly lacks annotation features or options to jump between different sections of the content like books. And most podcasts don’t want you to skip, they want you to engage with the whole programme. So we listen to hours and hours of podcasts but hardly capture or understand everything being said. We assume that we have understood something and make our own assumption - reinforcing our own beliefs rather than enhancing them."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"So when I felt that the things I was listening weren't really adding value. I experimented by replacing it with instrumental music - lofi music (something that is in trend right now). Interestingly, it had a similar impact. The music was playing in the background, just like the podcasts, while my brain was on its own trajectory of thoughts, minus the voice of authority. Maybe we are undermining the power and influence of an audio."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The abundance of content and information (true or fake) may have blinded our ability to make a better judgement. We are merely making decisions based on hearsay. The loud and continuous streaming of texts and videos may have created hundreds of factions in our society. But the podcasts or any newer format of audio platform is just going to put that on a steroid. Imagine, 7 billion people speaking their mind at once. Who is listening? No one. And we are not even half aware of what we are saying."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"When a long format of video and audio content started to come in trend, there was a growing consensus that we were looking for more deeper and meaningful conversations. Instead, we now have boisterous loud virtual parties thrown by millionaires and billionaires and everyone's invited :)."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Since the beginning of the human race there have only been two rituals. One where a small crowd gathered around a campfire to listen to a great story. Next where a mass people gathered to chant together in unison while the leader of the tribe made the offering to the higher power. Where will this podcasting lead us? Your guess is as good as mine."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:blog:a-deeper-thought-on-podcast.md","_source":"content","_file":"blog/a-deeper-thought-on-podcast.md","_extension":"md"},{"_path":"/blog/how-to-avoid-killing-an-idea","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"How to avoid killing an idea?","description":"Taking idea to completion","publishedDate":"Apr 19, 2022","slug":"how-to-avoid-killing-an-idea","abstract":"Writing is the first step towards articulating the idea with your selves. It allows you to review your thoughts and take the moment to revise and refine it before you can share it with the world.","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I often take inspiration from interviews of great movie directors, writers and artists. There is so much to learn from their ways of thinking and working."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"What fascinates me, is their journey of bringing an idea to life."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"You often hear them say, “This movie script was with me for the last 10 years, before I finally had a chance to make it.” This bewilders me. How can someone hold on to an idea for such a long time? Are they not distracted?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In a startup world, things are different. Forget about ideas from 10 years ago, we barely remember our ideas from last week. We move at such a rapid pace that we are always in a race to catch the next tech or design trend. We barely get a chance to hold on to an idea for a long period. But we proudly say, “Just ship it.”"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"How can we avoid killing an idea and hold onto it more?"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I am asking this question as an entrepreneur who is also a creator."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Often you will hear a founder say, “I am working on this cool idea.” And you meet him/her after a few months and ask,”Hye, how is the idea coming up?”. You immediately hear, “Oh, I pivoted. I am working on another cool idea.”"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"And I am certain that whatever the idea was, it had a premature death. This way of thinking and working is so common in our industry. I strongly feel that we must write down our ideas before we even execute them. Just like a movie script, create a long well thought out script for your idea."}]},{"type":"element","tag":"blockquote","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Writing is the first step towards articulating the idea with your selves. It allows you to review your thoughts and take the moment to revise and refine it before you can share it with the world."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"But in this age of digital collaboration and connectedness, we are streaming our half baked thoughts on slack channels and social media at an alarming speed. The response to which is often in a form of feeble digital interaction like thumbs up, emoticons and memes."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This stream of thoughts is beaming through our digital devices, like a bright sun, blinding our sight and we are trapped in an infinite scroll of digital content."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"No wonder we are killing ideas every second - one after the other. No ideas are getting their due respect but are swiped left and right. Only those ideas that can sustain this speed are adopted while others are deleted - not even archived ."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"It is important that we write down our ideas, revise them and refine it so that it can be articulated better with the world."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"‍The clearer you can communicate your idea, the closer you are at executing them and better at predicting the outcomes."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"There should be a space either digital or physical, where you allow your ideas to flourish in a form of neatly composed sentences and paragraphs. You are not writing down just to record it but to understand it better."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I am not referring to writing as in creating a todo list of items. Instead, I want each individual idea to have its own story where it is explored."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"So, you have an idea! Imagine yourself writing a Hollywood masterpiece."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"And just like a movie script, start with a simple text editor and a blinking cursor."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"And start typing…"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:blog:how-to-avoid-killing-an-idea.md","_source":"content","_file":"blog/how-to-avoid-killing-an-idea.md","_extension":"md"}],"navigation":[{"title":"Blog","_path":"/blog","children":[{"title":"Is Podcast a productivity kill?","_path":"/blog/a-deeper-thought-on-podcast"},{"title":"How to avoid killing an idea?","_path":"/blog/how-to-avoid-killing-an-idea"}]}]}